#include <stdio.h>

int main() {
    int a = 4; 
    // 변수 a에 담긴 값 '4'의 이진수표현은  "0000 0000 0000 0000 0000 0000 0000 0100" 입니다
    int b = 10;
    // 변수 b에 담긴 값 '10'의 이진수표현은  "0000 0000 0000 0000 0000 0000 0000 1010" 입니다

    printf( "%d\n", a & b ); 
    // 출력: 0 | 0000 ... 0000 0100 AND 0000 ... 0000 1010 = 0000(2진수) (=0(10진수))
    printf( "%d\n", a | b ); 
    // 출력: 14 | 0000 ... 0000 0100 OR 0000 ... 0000 1010 = 1110(2진수) (=14(10진수))
    printf( "%d\n", a ^ b ); 
    // 출력: 14 | 0000 ... 0000 0100 XOR 0000 ... 0000 1010 = 1110(2진수) (=14(10진수))
    printf( "%d\n", ~a ); 
    // 출력: -5
    // : NOT ( 0000 0000 0000 0000 0000 0000 0000 0100 ) = 1111 ... 0000 1011 (=-5(10진수) / '2의 보수' 적용)
    printf( "%d\n", b >> a ); 
    // 출력: 0
    // : '0000 ... 0000 1010'에서 전체bit를 오른쪽으로 a칸 (=4칸) 밀면 모든 bit가 0입니다
    printf( "%d\n", b << a ); 
    // 출력: 160
    // : '0000 ... 0000 1010'에서 전체bit를 왼쪽으로 a칸 (=4칸) 밀면 0000 ... 0000 1010 0000 (=160(10진수)) 입니다
    return 0;
}